# GetCablePartsCnt

## Description
Get the count of cable parts in the cable or cable section. If SectionIndex is set to 0 it will be ignored.

```pascal
FUNCTION GetCablePartsCnt(
				hObj         : HANDLE;
				SectionIndex : INTEGER) : INTEGER;
```

```python

def vs.GetCablePartsCnt(hObj, SectionIndex):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObj|HANDLE||
|SectionIndex|INTEGER||

## Version
Availability: from Vectorworks 2025.4
## Category
* Objects - Cables